IDEA Open Model
IDEAProgress.Report Method
Compatible with IDEA StatiCa v 10.1
 Report
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public void Report(
	IDEAProgressReport data
)
Public Sub Report (
	data As IDEAProgressReport
)
public:
void Report(
	IDEAProgressReport^ data
)
Parameters
data
Type: IdeaRS.OpenModel.Message.IDEAProgressReport
Data for progress report of IOM
See Also
Reference
IDEAProgress Class
IdeaRS.OpenModel.Message Namespace